qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
#elif defined(CORE_M0)
/* ---------------------------------------------------------------------------
 * LPC43xx (M0 Core) Cortex CMSIS definitions
 */

#define __MPU_PRESENT             0     /* MPU present or not                    */
#define __NVIC_PRIO_BITS          2     /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0     /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             0     /* FPU present or not                    */
#define CHIP_LPC43XX                    /* LPCOPEN compatibility                 */

/* ---------------------------------------------------------------------------
 * LPC43xx (M0 Core) peripheral interrupt numbers
 */

typedef enum {
    /* ---------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
    Reset_IRQn                    = -15,/*   1  Reset Vector, invoked on Power up and warm reset */
    NonMaskableInt_IRQn           = -14,/*   2  Non maskable Interrupt, cannot be stopped or preempted */
    HardFault_IRQn                = -13,/*   3  Hard Fault, all classes of Fault */
    SVCall_IRQn                   =  -5,/*  11  System Service Call via SVC instruction */
    DebugMonitor_IRQn             =  -4,/*  12  Debug Monitor                    */
    PendSV_IRQn                   =  -2,/*  14  Pendable request for system service */
    SysTick_IRQn                  =  -1,/*  15  System Tick Timer           */

    /* -----------------  LPC18xx/43xx Specific Interrupt Numbers  --------------------- */
    DAC_IRQn                      =   0,/*   0  DAC                              */
    M0_M4CORE_IRQn                =   1,/*   1  M0a                              */
    DMA_IRQn                      =   2,/*   2  DMA  r                            */
    RESERVED1_IRQn                =   3,/*   3  EZH/EDM                          */
    FLASHEEPROM_IRQn              =   4,/*   4  ORed Flash EEPROM Bank A, B, EEPROM   */
    ETHERNET_IRQn                 =   5,/*   5  ETHERNET                         */
    SDIO_IRQn                     =   6,/*   6  SDIO                             */
    LCD_IRQn                      =   7,/*   7  LCD                              */
    USB0_IRQn                     =   8,/*   8  USB0                             */
    USB1_IRQn                     =   9,/*   9  USB1                             */
    SCT_IRQn                      =  10,/*  10  SCT                              */
    RITIMER_IRQn                  =  11,/*  11  ORed RITIMER, WDT                */
    TIMER0_IRQn                   =  12,/*  12  TIMER0                           */
    GINT1_IRQn                    =  13,/*  13  GINT1                            */
    PIN_INT4_IRQn                 =  14,/*  14  GPIO 4                           */
    TIMER3_IRQn                   =  15,/*  15  TIMER3                           */
    MCPWM_IRQn                    =  16,/*  16  MCPWM                            */
    ADC0_IRQn                     =  17,/*  17  ADC0                             */
    I2C0_IRQn                     =  18,/*  18  ORed I2C0, I2C1                  */
    SGPIO_INT_IRQn                =  19,/*  19  SGPIO                            */
    SPI_INT_IRQn                  =  20,/*  20  SPI_INT                          */
    ADC1_IRQn                     =  21,/*  21  ADC1                             */
    SSP0_IRQn                     =  22,/*  22  ORed SSP0, SSP1                  */
    EVENTROUTER_IRQn              =  23,/*  23  EVENTROUTER                      */
    USART0_IRQn                   =  24,/*  24  USART0                           */
    UART1_IRQn                    =  25,/*  25  UART1                            */
    USART2_IRQn                   =  26,/*  26  USART2                           */
    USART3_IRQn                   =  27,/*  27  USART3                           */
    I2S0_IRQn                     =  28,/*  28  ORed I2S0, I2S1                  */
    C_CAN0_IRQn                   =  29,/*  29  C_CAN0                           */
    I2S1_IRQn                     =  29,/*  29  I2S1                             */
    RESERVED2_IRQn                =  30,
    RESERVED3_IRQn                =  31,
} IRQn_Type;

#include "core_cm0.h"                        /* Cortex-M4 processor and core peripherals */
#else
#error Please #define CORE_M0, CORE_M3 or CORE_M4
#endif

#include "system_LPC43xx.h"

/* ---------------------------------------------------------------------------
 * State Configurable Timer register block structure
 */
#define LPC_SCT_BASE              0x40000000
#define CONFIG_SCT_nEV   (16)           /* Number of events */
#define CONFIG_SCT_nRG   (16)           /* Number of match/compare registers */
#define CONFIG_SCT_nOU   (16)           /* Number of outputs */

typedef struct {
    __IO  uint32_t CONFIG;              /* Configuration Register */
    union {
        __IO uint32_t CTRL_U;           /* Control Register */
        struct {
            __IO uint16_t CTRL_L;       /* Low control register */
            __IO uint16_t CTRL_H;       /* High control register */
        };

    };

    __IO uint16_t LIMIT_L;              /* limit register for counter L */
    __IO uint16_t LIMIT_H;              /* limit register for counter H */
    __IO uint16_t HALT_L;               /* halt register for counter L */
    __IO uint16_t HALT_H;               /* halt register for counter H */
    __IO uint16_t STOP_L;               /* stop register for counter L */
    __IO uint16_t STOP_H;               /* stop register for counter H */
    __IO uint16_t START_L;              /* start register for counter L */
    __IO uint16_t START_H;              /* start register for counter H */
    uint32_t RESERVED1[10];             /* 0x03C reserved */
    union {
        __IO uint32_t COUNT_U;          /* counter register */
        struct {
            __IO uint16_t COUNT_L;      /* counter register for counter L */
            __IO uint16_t COUNT_H;      /* counter register for counter H */
        };

