qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
    };

    __IO uint16_t STATE_L;              /* state register for counter L */
    __IO uint16_t STATE_H;              /* state register for counter H */
    __I  uint32_t INPUT;                /* input register */
    __IO uint16_t REGMODE_L;            /* match - capture registers mode register L */
    __IO uint16_t REGMODE_H;            /* match - capture registers mode register H */
    __IO uint32_t OUTPUT;               /* output register */
    __IO uint32_t OUTPUTDIRCTRL;        /* output counter direction Control Register */
    __IO uint32_t RES;                  /* conflict resolution register */
    __IO uint32_t DMA0REQUEST;          /* DMA0 Request Register */
    __IO uint32_t DMA1REQUEST;          /* DMA1 Request Register */
    uint32_t RESERVED2[35];
    __IO uint32_t EVEN;                 /* event enable register */
    __IO uint32_t EVFLAG;               /* event flag register */
    __IO uint32_t CONEN;                /* conflict enable register */
    __IO uint32_t CONFLAG;              /* conflict flag register */
    union {
        __IO union {                    /* ... Match / Capture value */
            uint32_t U;                 /*       SCTMATCH[i].U  Unified 32-bit register */
            struct {
                uint16_t L;             /*       SCTMATCH[i].L  Access to L value */
                uint16_t H;             /*       SCTMATCH[i].H  Access to H value */
            };

        } MATCH[CONFIG_SCT_nRG];

        __I union {
            uint32_t U;                 /*       SCTCAP[i].U  Unified 32-bit register */
            struct {
                uint16_t L;             /*       SCTCAP[i].L  Access to L value */
                uint16_t H;             /*       SCTCAP[i].H  Access to H value */
            };

        } CAP[CONFIG_SCT_nRG];

    };

    uint32_t RESERVED3[32 - CONFIG_SCT_nRG];    /* ...-0x17C reserved */
    union {
        __IO uint16_t MATCH_L[CONFIG_SCT_nRG];  /* 0x180-... Match Value L counter */
        __I  uint16_t CAP_L[CONFIG_SCT_nRG];    /* 0x180-... Capture Value L counter */
    };

    uint16_t RESERVED4[32 - CONFIG_SCT_nRG];    /* ...-0x1BE reserved */
    union {
        __IO uint16_t MATCH_H[CONFIG_SCT_nRG];  /* 0x1C0-... Match Value H counter */
        __I  uint16_t CAP_H[CONFIG_SCT_nRG];    /* 0x1C0-... Capture Value H counter */
    };

    uint16_t RESERVED5[32 - CONFIG_SCT_nRG];    /* ...-0x1FE reserved */
    union {
        __IO union {                    /* 0x200-... Match Reload / Capture Control value */
            uint32_t U;                 /*       SCTMATCHREL[i].U  Unified 32-bit register */
            struct {
                uint16_t L;             /*       SCTMATCHREL[i].L  Access to L value */
                uint16_t H;             /*       SCTMATCHREL[i].H  Access to H value */
            };

        } MATCHREL[CONFIG_SCT_nRG];

        __IO union {
            uint32_t U;                 /*       SCTCAPCTRL[i].U  Unified 32-bit register */
            struct {
                uint16_t L;             /*       SCTCAPCTRL[i].L  Access to L value */
                uint16_t H;             /*       SCTCAPCTRL[i].H  Access to H value */
            };

        } CAPCTRL[CONFIG_SCT_nRG];

    };

    uint32_t RESERVED6[32 - CONFIG_SCT_nRG];    /* ...-0x27C reserved */
    union {
        __IO uint16_t MATCHREL_L[CONFIG_SCT_nRG]; /* 0x280-... Match Reload value L counter */
        __IO uint16_t CAPCTRL_L[CONFIG_SCT_nRG];  /* 0x280-... Capture Control value L counter */
    };

    uint16_t RESERVED7[32 - CONFIG_SCT_nRG];    /* ...-0x2BE reserved */
    union {
        __IO uint16_t MATCHREL_H[CONFIG_SCT_nRG]; /* 0x2C0-... Match Reload value H counter */
        __IO uint16_t CAPCTRL_H[CONFIG_SCT_nRG];  /* 0x2C0-... Capture Control value H counter */
    };

    uint16_t RESERVED8[32 - CONFIG_SCT_nRG];    /* ...-0x2FE reserved */
    __IO struct {                       /* 0x300-0x3FC  SCTEVENT[i].STATE / SCTEVENT[i].CTRL*/
        uint32_t STATE;                 /* Event State Register */
        uint32_t CTRL;                  /* Event Control Register */
    } EVENT[CONFIG_SCT_nEV];

    uint32_t RESERVED9[128 - 2 * CONFIG_SCT_nEV]; /* ...-0x4FC reserved */
    __IO struct {                       /* 0x500-0x57C  SCTOUT[i].SET / SCTOUT[i].CLR */
        uint32_t SET;                   /* Output n Set Register */
        uint32_t CLR;                   /* Output n Clear Register */
    } OUT[CONFIG_SCT_nOU];

    uint32_t RESERVED10[191 - 2 * CONFIG_SCT_nOU];  /* ...-0x7F8 reserved */
    __I  uint32_t MODULECONTENT;        /* 0x7FC Module Content */
} LPC_SCT_T;

/* Macro defines for SCT configuration register */
#define SCT_CONFIG_16BIT_COUNTER        0x00000000    /* Operate as 2 16-bit counters */
#define SCT_CONFIG_32BIT_COUNTER        0x00000001    /* Operate as 1 32-bit counter */

#define SCT_CONFIG_CLKMODE_BUSCLK       (0x0 << 1)    /* Bus clock */
#define SCT_CONFIG_CLKMODE_SCTCLK       (0x1 << 1)    /* SCT clock */
#define SCT_CONFIG_CLKMODE_INCLK        (0x2 << 1)    /* Input clock selected in CLKSEL field */
#define SCT_CONFIG_CLKMODE_INEDGECLK    (0x3 << 1)    /* Input clock edge selected in CLKSEL field */

#define SCT_CONFIG_NORELOADL_U          (0x1 << 7)    /* Operate as 1 32-bit counter */
#define SCT_CONFIG_NORELOADH            (0x1 << 8)    /* Operate as 1 32-bit counter */

/* Macro defines for SCT control register */
#define COUNTUP_TO_LIMIT_THEN_CLEAR_TO_ZERO     0     /* Direction for low or unified counter */
#define COUNTUP_TO LIMIT_THEN_COUNTDOWN_TO_ZERO 1

#define SCT_CTRL_STOP_L                 (1 << 1)      /* Stop low counter */
#define SCT_CTRL_HALT_L                 (1 << 2)      /* Halt low counter */
#define SCT_CTRL_CLRCTR_L               (1 << 3)      /* Clear low or unified counter */
#define SCT_CTRL_BIDIR_L(x)             (((x) & 0x01) << 4) /* Bidirectional bit */
#define SCT_CTRL_PRE_L(x)               (((x) & 0xFF) << 5) /* Prescale clock for low or unified counter */

#define COUNTUP_TO_LIMIT_THEN_CLEAR_TO_ZERO     0     /* Direction for high counter */
#define COUNTUP_TO LIMIT_THEN_COUNTDOWN_TO_ZERO 1
#define SCT_CTRL_STOP_H                 (1 << 17)     /* Stop high counter */
#define SCT_CTRL_HALT_H                 (1 << 18)     /* Halt high counter */
#define SCT_CTRL_CLRCTR_H               (1 << 19)     /* Clear high counter */
#define SCT_CTRL_BIDIR_H(x)             (((x) & 0x01) << 20)
#define SCT_CTRL_PRE_H(x)               (((x) & 0xFF) << 21) /* Prescale clock for high counter */

