qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
/* Macro defines for SCT Conflict resolution register */
#define SCT_RES_NOCHANGE                (0)
#define SCT_RES_SET_OUTPUT              (1)
#define SCT_RES_CLEAR_OUTPUT            (2)
#define SCT_RES_TOGGLE_OUTPUT           (3)

/* ---------------------------------------------------------------------------
 * GPDMA Channel register block structure
 */
#define LPC_GPDMA_BASE            0x40002000

typedef struct {
    __IO uint32_t  SRCADDR;             /* DMA Channel Source Address Register */
    __IO uint32_t  DESTADDR;            /* DMA Channel Destination Address Register */
    __IO uint32_t  LLI;                 /* DMA Channel Linked List Item Register */
    __IO uint32_t  CONTROL;             /* DMA Channel Control Register */
    __IO uint32_t  CONFIG;              /* DMA Channel Configuration Register */
    __I  uint32_t  RESERVED1[3];
} LPC_GPDMA_CH_T;

#define GPDMA_CHANNELS 8

/* ---------------------------------------------------------------------------
 * GPDMA register block
 */
typedef struct {                        /* GPDMA Structure */
    __I  uint32_t  INTSTAT;             /* DMA Interrupt Status Register */
    __I  uint32_t  INTTCSTAT;           /* DMA Interrupt Terminal Count Request Status Register */
    __O  uint32_t  INTTCCLEAR;          /* DMA Interrupt Terminal Count Request Clear Register */
    __I  uint32_t  INTERRSTAT;          /* DMA Interrupt Error Status Register */
    __O  uint32_t  INTERRCLR;           /* DMA Interrupt Error Clear Register */
    __I  uint32_t  RAWINTTCSTAT;        /* DMA Raw Interrupt Terminal Count Status Register */
    __I  uint32_t  RAWINTERRSTAT;       /* DMA Raw Error Interrupt Status Register */
    __I  uint32_t  ENBLDCHNS;           /* DMA Enabled Channel Register */
    __IO uint32_t  SOFTBREQ;            /* DMA Software Burst Request Register */
    __IO uint32_t  SOFTSREQ;            /* DMA Software Single Request Register */
    __IO uint32_t  SOFTLBREQ;           /* DMA Software Last Burst Request Register */
    __IO uint32_t  SOFTLSREQ;           /* DMA Software Last Single Request Register */
    __IO uint32_t  CONFIG;              /* DMA Configuration Register */
    __IO uint32_t  SYNC;                /* DMA Synchronization Register */
    __I  uint32_t  RESERVED0[50];
    LPC_GPDMA_CH_T CH[GPDMA_CHANNELS];
} LPC_GPDMA_T;

/* ---------------------------------------------------------------------------
 * SPIFI register block structure
 */
#define LPC_SPIFI_BASE            0x40003000

typedef struct {           /* SPIFI Structure */
    __IO uint32_t CTRL;    /* Control register */
    __IO uint32_t CMD;     /* Command register */
    __IO uint32_t ADDR;    /* Address register */
    __IO uint32_t IDATA;   /* Intermediate data register */
    __IO uint32_t CLIMIT;  /* Cache limit register */
    union {
        __IO  uint32_t DATA;
        __IO  uint16_t DATA_HWORD;
        __IO  uint8_t  DATA_BYTE;
    };                     /* Data register */
    __IO uint32_t MCMD;    /* Memory command register */
    __IO uint32_t STAT;    /* Status register */
} LPC_SPIFI_T;

/* ---------------------------------------------------------------------------
 * SD/MMC & SDIO register block structure
 */
#define LPC_SDMMC_BASE            0x40004000

typedef struct {                /* SDMMC Structure        */
    __IO uint32_t  CTRL;        /* Control Register       */
    __IO uint32_t  PWREN;       /* Power Enable Register  */
    __IO uint32_t  CLKDIV;      /* Clock Divider Register */
    __IO uint32_t  CLKSRC;      /* SD Clock Source Register */
    __IO uint32_t  CLKENA;      /* Clock Enable Register  */
    __IO uint32_t  TMOUT;       /* Timeout Register       */
    __IO uint32_t  CTYPE;       /* Card Type Register     */
    __IO uint32_t  BLKSIZ;      /* Block Size Register    */
    __IO uint32_t  BYTCNT;      /* Byte Count Register    */
    __IO uint32_t  INTMASK;     /* Interrupt Mask Register */
    __IO uint32_t  CMDARG;      /* Command Argument Register */
    __IO uint32_t  CMD;         /* Command Register       */
    __I  uint32_t  RESP0;       /* Response Register 0    */
    __I  uint32_t  RESP1;       /* Response Register 1    */
    __I  uint32_t  RESP2;       /* Response Register 2    */
    __I  uint32_t  RESP3;       /* Response Register 3    */
    __I  uint32_t  MINTSTS;     /* Masked Interrupt Status Register */
    __IO uint32_t  RINTSTS;     /* Raw Interrupt Status Register */
    __I  uint32_t  STATUS;      /* Status Register        */
    __IO uint32_t  FIFOTH;      /* FIFO Threshold Watermark Register */
    __I  uint32_t  CDETECT;     /* Card Detect Register   */
    __I  uint32_t  WRTPRT;      /* Write Protect Register */
    __IO uint32_t  GPIO;        /* General Purpose Input/Output Register */
    __I  uint32_t  TCBCNT;      /* Transferred CIU Card Byte Count Register */
    __I  uint32_t  TBBCNT;      /* Transferred Host to BIU-FIFO Byte Count Register */
    __IO uint32_t  DEBNCE;      /* Debounce Count Register */
    __IO uint32_t  USRID;       /* User ID Register       */
    __I  uint32_t  VERID;       /* Version ID Register    */
    __I  uint32_t  RESERVED0;
    __IO uint32_t  UHS_REG;     /* UHS-1 Register         */
    __IO uint32_t  RST_N;       /* Hardware Reset         */
    __I  uint32_t  RESERVED1;
    __IO uint32_t  BMOD;        /* Bus Mode Register      */
    __O  uint32_t  PLDMND;      /* Poll Demand Register   */
    __IO uint32_t  DBADDR;      /* Descriptor List Base Address Register */
    __IO uint32_t  IDSTS;       /* Internal DMAC Status Register */
    __IO uint32_t  IDINTEN;     /* Internal DMAC Interrupt Enable Register */
    __I  uint32_t  DSCADDR;     /* Current Host Descriptor Address Register */
    __I  uint32_t  BUFADDR;     /* Current Buffer Descriptor Address Register */
} LPC_SDMMC_T;

/* ---------------------------------------------------------------------------
 * External Memory Controller (EMC) register block structure
 */
#define LPC_EMC_BASE              0x40005000

typedef struct {                        /* EMC Structure          */
    __IO uint32_t  CONTROL;             /* Controls operation of the memory controller. */
    __I  uint32_t  STATUS;              /* Provides EMC status information. */
    __IO uint32_t  CONFIG;              /* Configures operation of the memory controller. */
    __I  uint32_t  RESERVED0[5];
    __IO uint32_t  DYNAMICCONTROL;      /* Controls dynamic memory operation. */
    __IO uint32_t  DYNAMICREFRESH;      /* Configures dynamic memory refresh operation. */
    __IO uint32_t  DYNAMICREADCONFIG;   /* Configures the dynamic memory read strategy. */
    __I  uint32_t  RESERVED1;
    __IO uint32_t  DYNAMICRP;           /* Selects the precharge command period. */
    __IO uint32_t  DYNAMICRAS;          /* Selects the active to precharge command period. */
    __IO uint32_t  DYNAMICSREX;         /* Selects the self-refresh exit time. */
    __IO uint32_t  DYNAMICAPR;          /* Selects the last-data-out to active command time. */
    __IO uint32_t  DYNAMICDAL;          /* Selects the data-in to active command time. */
    __IO uint32_t  DYNAMICWR;           /* Selects the write recovery time. */
    __IO uint32_t  DYNAMICRC;           /* Selects the active to active command period. */
    __IO uint32_t  DYNAMICRFC;          /* Selects the auto-refresh period. */
    __IO uint32_t  DYNAMICXSR;          /* Selects the exit self-refresh to active command time. */
    __IO uint32_t  DYNAMICRRD;          /* Selects the active bank A to active bank B latency. */
    __IO uint32_t  DYNAMICMRD;          /* Selects the load mode register to active command time. */
    __I  uint32_t  RESERVED2[9];
    __IO uint32_t  STATICEXTENDEDWAIT;  /* Selects time for long static memory read and write transfers. */
    __I  uint32_t  RESERVED3[31];
    __IO uint32_t  DYNAMICCONFIG0;      /* Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS0;      /* Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED4[6];
    __IO uint32_t  DYNAMICCONFIG1;      /* Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS1;      /* Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED5[6];
    __IO uint32_t  DYNAMICCONFIG2;      /* Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS2;      /* Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED6[6];
    __IO uint32_t  DYNAMICCONFIG3;      /* Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS3;      /* Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED7[38];
    __IO uint32_t  STATICCONFIG0;       /* Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN0;      /* Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN0;      /* Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD0;       /* Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG0;      /* Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR0;       /* Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN0;     /* Selects bus turnaround cycles */
    __I  uint32_t  RESERVED8;
    __IO uint32_t  STATICCONFIG1;       /* Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN1;      /* Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN1;      /* Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD1;       /* Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG1;      /* Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR1;       /* Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN1;     /* Selects bus turnaround cycles */
    __I  uint32_t  RESERVED9;
    __IO uint32_t  STATICCONFIG2;       /* Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN2;      /* Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN2;      /* Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD2;       /* Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG2;      /* Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR2;       /* Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN2;     /* Selects bus turnaround cycles */
    __I  uint32_t  RESERVED10;
    __IO uint32_t  STATICCONFIG3;       /* Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN3;      /* Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN3;      /* Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD3;       /* Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG3;      /* Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR3;       /* Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN3;     /* Selects bus turnaround cycles */
} LPC_EMC_T;

/* ---------------------------------------------------------------------------
 * USB High-Speed register block structure
 */
#define LPC_USB0_BASE             0x40006000
#define LPC_USB1_BASE             0x40007000

typedef struct {                        /* USB Structure         */
    __I  uint32_t  RESERVED0[64];
    __I  uint32_t  CAPLENGTH;           /* Capability register length */
    __I  uint32_t  HCSPARAMS;           /* Host controller structural parameters */
    __I  uint32_t  HCCPARAMS;           /* Host controller capability parameters */
    __I  uint32_t  RESERVED1[5];
    __I  uint32_t  DCIVERSION;          /* Device interface version number */
    __I  uint32_t  RESERVED2[7];
    union {
        __IO uint32_t  USBCMD_H;        /* USB command (host mode) */
        __IO uint32_t  USBCMD_D;        /* USB command (device mode) */
    };

    union {
        __IO uint32_t  USBSTS_H;        /* USB status (host mode) */
        __IO uint32_t  USBSTS_D;        /* USB status (device mode) */
    };

    union {
        __IO uint32_t  USBINTR_H;       /* USB interrupt enable (host mode) */
        __IO uint32_t  USBINTR_D;       /* USB interrupt enable (device mode) */
    };

    union {
        __IO uint32_t  FRINDEX_H;       /* USB frame index (host mode) */
        __I  uint32_t  FRINDEX_D;       /* USB frame index (device mode) */
    };

    __I  uint32_t  RESERVED3;
    union {
        __IO uint32_t  PERIODICLISTBASE; /* Frame list base address */
        __IO uint32_t  DEVICEADDR;      /* USB device address     */
    };

    union {
        __IO uint32_t  ASYNCLISTADDR;   /* Address of endpoint list in memory (host mode) */
        __IO uint32_t  ENDPOINTLISTADDR; /* Address of endpoint list in memory (device mode) */
    };

    __IO uint32_t  TTCTRL;              /* Asynchronous buffer status for embedded TT (host mode) */
    __IO uint32_t  BURSTSIZE;           /* Programmable burst size */
    __IO uint32_t  TXFILLTUNING;        /* Host transmit pre-buffer packet tuning (host mode) */
    __I  uint32_t  RESERVED4[2];
    __IO uint32_t  ULPIVIEWPORT;        /* ULPI viewport          */
    __IO uint32_t  BINTERVAL;           /* Length of virtual frame */
    __IO uint32_t  ENDPTNAK;            /* Endpoint NAK (device mode) */
    __IO uint32_t  ENDPTNAKEN;          /* Endpoint NAK Enable (device mode) */
    __I  uint32_t  RESERVED5;
    union {
        __IO uint32_t  PORTSC1_H;       /* Port 1 status/control (host mode) */
        __IO uint32_t  PORTSC1_D;       /* Port 1 status/control (device mode) */
    };

