qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
    __I  uint32_t  RESERVED6[7];
    __IO uint32_t  OTGSC;               /* OTG status and control */
    union {
        __IO uint32_t  USBMODE_H;       /* USB mode (host mode)   */
        __IO uint32_t  USBMODE_D;       /* USB mode (device mode) */
    };

    __IO uint32_t  ENDPTSETUPSTAT;      /* Endpoint setup status  */
    __IO uint32_t  ENDPTPRIME;          /* Endpoint initialization */
    __IO uint32_t  ENDPTFLUSH;          /* Endpoint de-initialization */
    __I  uint32_t  ENDPTSTAT;           /* Endpoint status        */
    __IO uint32_t  ENDPTCOMPLETE;       /* Endpoint complete      */
    __IO uint32_t  ENDPTCTRL[6];        /* Endpoint control 0     */
} LPC_USBHS_T;

/* ---------------------------------------------------------------------------
 * LCD Controller register block structure
 */
#define LPC_LCD_BASE              0x40008000

typedef struct {                /* LCD Structure          */
    __IO uint32_t  TIMH;        /* Horizontal Timing Control register */
    __IO uint32_t  TIMV;        /* Vertical Timing Control register */
    __IO uint32_t  POL;         /* Clock and Signal Polarity Control register */
    __IO uint32_t  LE;          /* Line End Control register */
    __IO uint32_t  UPBASE;      /* Upper Panel Frame Base Address register */
    __IO uint32_t  LPBASE;      /* Lower Panel Frame Base Address register */
    __IO uint32_t  CTRL;        /* LCD Control register   */
    __IO uint32_t  INTMSK;      /* Interrupt Mask register */
    __I  uint32_t  INTRAW;      /* Raw Interrupt Status register */
    __I  uint32_t  INTSTAT;     /* Masked Interrupt Status register */
    __O  uint32_t  INTCLR;      /* Interrupt Clear register */
    __I  uint32_t  UPCURR;      /* Upper Panel Current Address Value register */
    __I  uint32_t  LPCURR;      /* Lower Panel Current Address Value register */
    __I  uint32_t  RESERVED0[115];
    __IO uint16_t PAL[256];     /* 256x16-bit Color Palette registers */
    __I  uint32_t  RESERVED1[256];
    __IO uint32_t CRSR_IMG[256];/* Cursor Image registers */
    __IO uint32_t  CRSR_CTRL;   /* Cursor Control register */
    __IO uint32_t  CRSR_CFG;    /* Cursor Configuration register */
    __IO uint32_t  CRSR_PAL0;   /* Cursor Palette register 0 */
    __IO uint32_t  CRSR_PAL1;   /* Cursor Palette register 1 */
    __IO uint32_t  CRSR_XY;     /* Cursor XY Position register */
    __IO uint32_t  CRSR_CLIP;   /* Cursor Clip Position register */
    __I  uint32_t  RESERVED2[2];
    __IO uint32_t  CRSR_INTMSK; /* Cursor Interrupt Mask register */
    __O  uint32_t  CRSR_INTCLR; /* Cursor Interrupt Clear register */
    __I  uint32_t  CRSR_INTRAW; /* Cursor Raw Interrupt Status register */
    __I  uint32_t  CRSR_INTSTAT;/* Cursor Masked Interrupt Status register */
} LPC_LCD_T;

/* ---------------------------------------------------------------------------
 * EEPROM register block structure
 */
#define LPC_EEPROM_BASE           0x4000E000

typedef struct {                /* EEPROM Structure */
    __IO uint32_t CMD;          /* EEPROM command register */
    uint32_t RESERVED0;
    __IO uint32_t RWSTATE;      /* EEPROM read wait state register */
    __IO uint32_t AUTOPROG;     /* EEPROM auto programming register */
    __IO uint32_t WSTATE;       /* EEPROM wait state register */
    __IO uint32_t CLKDIV;       /* EEPROM clock divider register */
    __IO uint32_t PWRDWN;       /* EEPROM power-down register */
    uint32_t RESERVED2[1007];
    __O  uint32_t INTENCLR;     /* EEPROM interrupt enable clear */
    __O  uint32_t INTENSET;     /* EEPROM interrupt enable set */
    __I  uint32_t INTSTAT;      /* EEPROM interrupt status */
    __I  uint32_t INTEN;        /* EEPROM interrupt enable */
    __O  uint32_t INTSTATCLR;   /* EEPROM interrupt status clear */
    __O  uint32_t INTSTATSET;   /* EEPROM interrupt status set */
} LPC_EEPROM_T;

/* ---------------------------------------------------------------------------
 * 10/100 MII & RMII Ethernet with timestamping register block structure
 */
#define LPC_ETHERNET_BASE         0x40010000

typedef struct {                        /* ETHERNET Structure */
    __IO uint32_t  MAC_CONFIG;          /* MAC configuration register */
    __IO uint32_t  MAC_FRAME_FILTER;    /* MAC frame filter */
    __IO uint32_t  MAC_HASHTABLE_HIGH;  /* Hash table high register */
    __IO uint32_t  MAC_HASHTABLE_LOW;   /* Hash table low register */
    __IO uint32_t  MAC_MII_ADDR;        /* MII address register */
    __IO uint32_t  MAC_MII_DATA;        /* MII data register */
    __IO uint32_t  MAC_FLOW_CTRL;       /* Flow control register */
    __IO uint32_t  MAC_VLAN_TAG;        /* VLAN tag register */
    __I  uint32_t  RESERVED0;
    __I  uint32_t  MAC_DEBUG;           /* Debug register */
    __IO uint32_t  MAC_RWAKE_FRFLT;     /* Remote wake-up frame filter */
    __IO uint32_t  MAC_PMT_CTRL_STAT;   /* PMT control and status */
    __I  uint32_t  RESERVED1[2];
    __I  uint32_t  MAC_INTR;            /* Interrupt status register */
    __IO uint32_t  MAC_INTR_MASK;       /* Interrupt mask register */
    __IO uint32_t  MAC_ADDR0_HIGH;      /* MAC address 0 high register */
    __IO uint32_t  MAC_ADDR0_LOW;       /* MAC address 0 low register */
    __I  uint32_t  RESERVED2[430];
    __IO uint32_t  MAC_TIMESTP_CTRL;    /* Time stamp control register */
    __IO uint32_t  SUBSECOND_INCR;      /* Sub-second increment register */
    __I  uint32_t  SECONDS;             /* System time seconds register */
    __I  uint32_t  NANOSECONDS;         /* System time nanoseconds register */
    __IO uint32_t  SECONDSUPDATE;       /* System time seconds update register */
    __IO uint32_t  NANOSECONDSUPDATE;   /* System time nanoseconds update register */
    __IO uint32_t  ADDEND;              /* Time stamp addend register */
    __IO uint32_t  TARGETSECONDS;       /* Target time seconds register */
    __IO uint32_t  TARGETNANOSECONDS;   /* Target time nanoseconds register */
    __IO uint32_t  HIGHWORD;            /* System time higher word seconds register */
    __I  uint32_t  TIMESTAMPSTAT;       /* Time stamp status register */
    __IO uint32_t  PPSCTRL;             /* PPS control register */
    __I  uint32_t  AUXNANOSECONDS;      /* Auxiliary time stamp nanoseconds register */
    __I  uint32_t  AUXSECONDS;          /* Auxiliary time stamp seconds register */
    __I  uint32_t  RESERVED3[562];
    __IO uint32_t  DMA_BUS_MODE;        /* Bus Mode Register      */
    __IO uint32_t  DMA_TRANS_POLL_DEMAND; /* Transmit poll demand register */
    __IO uint32_t  DMA_REC_POLL_DEMAND; /* Receive poll demand register */
    __IO uint32_t  DMA_REC_DES_ADDR;    /* Receive descriptor list address register */
    __IO uint32_t  DMA_TRANS_DES_ADDR;  /* Transmit descriptor list address register */
    __IO uint32_t  DMA_STAT;            /* Status register */
    __IO uint32_t  DMA_OP_MODE;         /* Operation mode register */
    __IO uint32_t  DMA_INT_EN;          /* Interrupt enable register */
    __I  uint32_t  DMA_MFRM_BUFOF;      /* Missed frame and buffer overflow register */
    __IO uint32_t  DMA_REC_INT_WDT;     /* Receive interrupt watchdog timer register */
    __I  uint32_t  RESERVED4[8];
    __I  uint32_t  DMA_CURHOST_TRANS_DES; /* Current host transmit descriptor register */
    __I  uint32_t  DMA_CURHOST_REC_DES; /* Current host receive descriptor register */
    __I  uint32_t  DMA_CURHOST_TRANS_BUF; /* Current host transmit buffer address register */
    __I  uint32_t  DMA_CURHOST_REC_BUF; /* Current host receive buffer address register */
} LPC_ENET_T;

/* ---------------------------------------------------------------------------
 * Alarm Timer register block structure
 */
#define LPC_ATIMER_BASE           0x40040000

typedef struct {                /* ATIMER Structure       */
    __IO uint32_t DOWNCOUNTER;  /* Downcounter register   */
    __IO uint32_t PRESET;       /* Preset value register  */
    __I  uint32_t RESERVED0[1012];
    __O  uint32_t CLR_EN;       /* Interrupt clear enable register */
    __O  uint32_t SET_EN;       /* Interrupt set enable register */
    __I  uint32_t STATUS;       /* Status register        */
    __I  uint32_t ENABLE;       /* Enable register        */
    __O  uint32_t CLR_STAT;     /* Clear register         */
    __O  uint32_t SET_STAT;     /* Set register           */
} LPC_ATIMER_T;

/* ---------------------------------------------------------------------------
 * Register File register block structure
 */
#define LPC_REGFILE_BASE          0x40041000

