qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
typedef struct {
    __IO uint32_t REGFILE[64];  /* General purpose storage register */
} LPC_REGFILE_T;

/* ---------------------------------------------------------------------------
 * Power Management Controller register block structure
 */
#define LPC_PMC_BASE              0x40042000

typedef struct {                        /* PMC Structure          */
    __IO uint32_t  PD0_SLEEP0_HW_ENA;   /* Hardware sleep event enable register */
    __I  uint32_t  RESERVED0[6];
    __IO uint32_t  PD0_SLEEP0_MODE;     /* Sleep power mode register */
} LPC_PMC_T;

/* ---------------------------------------------------------------------------
 * CREG Register Block
 */
#define LPC_CREG_BASE             0x40043000

typedef struct {                        /* CREG Structure         */
    __I  uint32_t  RESERVED0;
    __IO uint32_t  CREG0;               /* Chip configuration register 32 kHz oscillator output and BOD control register. */
    __I  uint32_t  RESERVED1[62];
    __IO uint32_t  MXMEMMAP;            /* ARM Cortex-M3/M4 memory mapping */
#if defined(CHIP_LPC18XX)
    __I  uint32_t  RESERVED2[5];
#else
    __I  uint32_t  RESERVED2;
    __I  uint32_t  CREG1;               /* Configuration Register 1 */
    __I  uint32_t  CREG2;               /* Configuration Register 2 */
    __I  uint32_t  CREG3;               /* Configuration Register 3 */
    __I  uint32_t  CREG4;               /* Configuration Register 4 */
#endif
    __IO uint32_t  CREG5;               /* Chip configuration register 5. Controls JTAG access. */
    __IO uint32_t  DMAMUX;              /* DMA muxing control     */
    __IO uint32_t  FLASHCFGA;           /* Flash accelerator configuration register for flash bank A */
    __IO uint32_t  FLASHCFGB;           /* Flash accelerator configuration register for flash bank B */
    __IO uint32_t  ETBCFG;              /* ETB RAM configuration  */
    __IO uint32_t  CREG6;               /* Chip configuration register 6. */
#if defined(CHIP_LPC18XX)
    __I  uint32_t  RESERVED4[52];
#else
    __IO uint32_t  M4TXEVENT;           /* M4 IPC event register */
    __I  uint32_t  RESERVED4[51];
#endif
    __I  uint32_t  CHIPID;              /* Part ID                */
#if defined(CHIP_LPC18XX)
    __I  uint32_t  RESERVED5[191];
#else
    __I  uint32_t  RESERVED5[127];
    __IO uint32_t  M0TXEVENT;           /* M0 IPC Event register */
    __IO uint32_t  M0APPMEMMAP;         /* ARM Cortex M0 memory mapping */
    __I  uint32_t  RESERVED6[62];
#endif
    __IO uint32_t  USB0FLADJ;           /* USB0 frame length adjust register */
    __I  uint32_t  RESERVED7[63];
    __IO uint32_t  USB1FLADJ;           /* USB1 frame length adjust register */
} LPC_CREG_T;

/* ---------------------------------------------------------------------------
 * Event Router register structure
 */
#define LPC_EVRT_BASE             0x40044000

typedef struct {                        /* EVENTROUTER Structure  */
    __IO uint32_t HILO;                 /* Level configuration register */
    __IO uint32_t EDGE;                 /* Edge configuration     */
    __I  uint32_t RESERVED0[1012];
    __O  uint32_t CLR_EN;               /* Event clear enable register */
    __O  uint32_t SET_EN;               /* Event set enable register */
    __I  uint32_t STATUS;               /* Status register        */
    __I  uint32_t ENABLE;               /* Enable register        */
    __O  uint32_t CLR_STAT;             /* Clear register         */
    __O  uint32_t SET_STAT;             /* Set register           */
} LPC_EVRT_T;

/* ---------------------------------------------------------------------------
 * Real Time Clock register block structure
 */
#define LPC_RTC_BASE              0x40046000
#define RTC_EV_SUPPORT      1           /* Event Monitor/Recorder support */

typedef enum RTC_TIMEINDEX {
    RTC_TIMETYPE_SECOND,        /* Second */
    RTC_TIMETYPE_MINUTE,        /* Month */
    RTC_TIMETYPE_HOUR,          /* Hour */
    RTC_TIMETYPE_DAYOFMONTH,    /* Day of month */
    RTC_TIMETYPE_DAYOFWEEK,     /* Day of week */
    RTC_TIMETYPE_DAYOFYEAR,     /* Day of year */
    RTC_TIMETYPE_MONTH,         /* Month */
    RTC_TIMETYPE_YEAR,          /* Year */
    RTC_TIMETYPE_LAST
} RTC_TIMEINDEX_T;

#if RTC_EV_SUPPORT
typedef enum LPC_RTC_EV_CHANNEL {
    RTC_EV_CHANNEL_1 = 0,
    RTC_EV_CHANNEL_2,
    RTC_EV_CHANNEL_3,
    RTC_EV_CHANNEL_NUM,
} LPC_RTC_EV_CHANNEL_T;
#endif /*RTC_EV_SUPPORT*/

typedef struct {                        /* RTC Structure          */
    __IO uint32_t  ILR;                 /* Interrupt Location Register */
    __I  uint32_t  RESERVED0;
    __IO uint32_t  CCR;                 /* Clock Control Register */
    __IO uint32_t  CIIR;                /* Counter Increment Interrupt Register */
    __IO uint32_t  AMR;                 /* Alarm Mask Register    */
    __I  uint32_t  CTIME[3];            /* Consolidated Time Register 0,1,2 */
    __IO uint32_t  TIME[RTC_TIMETYPE_LAST]; /* Timer field registers */
    __IO uint32_t  CALIBRATION;         /* Calibration Value Register */
    __I  uint32_t  RESERVED1[7];
    __IO uint32_t  ALRM[RTC_TIMETYPE_LAST]; /* Alarm field registers */
#if RTC_EV_SUPPORT
    __IO uint32_t ERSTATUS;             /* Event Monitor/Recorder Status register*/
    __IO uint32_t ERCONTROL;            /* Event Monitor/Recorder Control register*/
    __I  uint32_t ERCOUNTERS;           /* Event Monitor/Recorder Counters register*/
    __I  uint32_t RESERVED2;
    __I  uint32_t ERFIRSTSTAMP[RTC_EV_CHANNEL_NUM]; /* Event Monitor/Recorder First Stamp registers*/
    __I  uint32_t RESERVED3;
    __I  uint32_t ERLASTSTAMP[RTC_EV_CHANNEL_NUM];  /* Event Monitor/Recorder Last Stamp registers*/
#endif /*RTC_EV_SUPPORT*/
} LPC_RTC_T;

/* ---------------------------------------------------------------------------
 * LPC18XX/43XX CGU register block structure
 */
#define LPC_CGU_BASE              0x40050000
#define LPC_CCU1_BASE             0x40051000
#define LPC_CCU2_BASE             0x40052000
/*
 * Input clocks for the CGU and can come from both external (crystal) and
 * internal (PLL) sources. Can be routed to the base clocks.
 */
typedef enum CGU_CLKIN {
    CLKIN_32K,      /* External 32KHz input */
    CLKIN_IRC,      /* Internal IRC (12MHz) input */
    CLKIN_ENET_RX,  /* External ENET_RX pin input */
    CLKIN_ENET_TX,  /* External ENET_TX pin input */
    CLKIN_CLKIN,    /* External GPCLKIN pin input */
    CLKIN_RESERVED1,
    CLKIN_CRYSTAL,  /* External (main) crystal pin input */
    CLKIN_USBPLL,   /* Internal USB PLL input */
    CLKIN_AUDIOPLL, /* Internal Audio PLL input */
    CLKIN_MAINPLL,  /* Internal Main PLL input */
    CLKIN_RESERVED2,
    CLKIN_RESERVED3,
    CLKIN_IDIVA,    /* Internal divider A input */
    CLKIN_IDIVB,    /* Internal divider B input */
    CLKIN_IDIVC,    /* Internal divider C input */
    CLKIN_IDIVD,    /* Internal divider D input */
    CLKIN_IDIVE,    /* Internal divider E input */
    CLKINPUT_PD     /* External 32KHz input */
} CGU_CLKIN_T;

#define CLKIN_PLL0USB    CLKIN_USBPLL
#define CLKIN_PLL0AUDIO  CLKIN_AUDIOPLL
#define CLKIN_PLL1       CLKIN_MAINPLL

