qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
/*
 * Audio or USB PLL selection
 */
typedef enum CGU_USB_AUDIO_PLL {
    CGU_USB_PLL,
    CGU_AUDIO_PLL
} CGU_USB_AUDIO_PLL_T;

/*
 * PLL register block
 */
typedef struct {
    __I  uint32_t  PLL_STAT;            /* PLL status register */
    __IO uint32_t  PLL_CTRL;            /* PLL control register */
    __IO uint32_t  PLL_MDIV;            /* PLL M-divider register */
    __IO uint32_t  PLL_NP_DIV;          /* PLL N/P-divider register */
} CGU_PLL_REG_T;

typedef struct {                        /* (@ 0x40050000) CGU Structure          */
    __I  uint32_t  RESERVED0[5];
    __IO uint32_t  FREQ_MON;            /* (@ 0x40050014) Frequency monitor register */
    __IO uint32_t  XTAL_OSC_CTRL;       /* (@ 0x40050018) Crystal oscillator control register */
    CGU_PLL_REG_T  PLL[CGU_AUDIO_PLL + 1]; /* (@ 0x4005001C) USB and audio PLL blocks */
    __IO uint32_t  PLL0AUDIO_FRAC;      /* (@ 0x4005003C) PLL0 (audio)           */
    __I  uint32_t  PLL1_STAT;           /* (@ 0x40050040) PLL1 status register   */
    __IO uint32_t  PLL1_CTRL;           /* (@ 0x40050044) PLL1 control register  */
    __IO uint32_t  IDIV_CTRL[CLK_IDIV_LAST];/* (@ 0x40050048) Integer divider A-E control registers */
    __IO uint32_t  BASE_CLK[CLK_BASE_LAST]; /* (@ 0x4005005C) Start of base clock registers */
} LPC_CGU_T;

/* ---------------------------------------------------------------------------
 * CCU clock config/status register pair
 */
typedef struct {
    __IO uint32_t  CFG;                 /* CCU clock configuration register */
    __I  uint32_t  STAT;                /* CCU clock status register */
} CCU_CFGSTAT_T;

/* ---------------------------------------------------------------------------
 * CCU1 register block structure
 */
typedef struct {                        /* (@ 0x40051000) CCU1 Structure         */
    __IO uint32_t  PM;                  /* (@ 0x40051000) CCU1 power mode register */
    __I  uint32_t  BASE_STAT;           /* (@ 0x40051004) CCU1 base clocks status register */
    __I  uint32_t  RESERVED0[62];
    CCU_CFGSTAT_T  CLKCCU[CLK_CCU1_LAST]; /* (@ 0x40051100) Start of CCU1 clock registers */
} LPC_CCU1_T;

/* ---------------------------------------------------------------------------
 * CCU2 register block structure
 */
typedef struct {                        /* (@ 0x40052000) CCU2 Structure         */
    __IO uint32_t  PM;                  /* (@ 0x40052000) Power mode register    */
    __I  uint32_t  BASE_STAT;           /* (@ 0x40052004) CCU base clocks status register */
    __I  uint32_t  RESERVED0[62];
    CCU_CFGSTAT_T  CLKCCU[CLK_CCU2_LAST - CLK_CCU1_LAST]; /* (@ 0x40052100) Start of CCU2 clock registers */
} LPC_CCU2_T;

/* ---------------------------------------------------------------------------
 * RGU register structure
 */
#define LPC_RGU_BASE              0x40053000

typedef enum RGU_RST {
    RGU_CORE_RST,
    RGU_PERIPH_RST,
    RGU_MASTER_RST,
    RGU_WWDT_RST = 4,
    RGU_CREG_RST,
    RGU_BUS_RST = 8,
    RGU_SCU_RST,
    RGU_M3_RST = 13,
    RGU_LCD_RST = 16,
    RGU_USB0_RST,
    RGU_USB1_RST,
    RGU_DMA_RST,
    RGU_SDIO_RST,
    RGU_EMC_RST,
    RGU_ETHERNET_RST,
    RGU_FLASHA_RST = 25,
    RGU_EEPROM_RST = 27,
    RGU_GPIO_RST,
    RGU_FLASHB_RST,
    RGU_TIMER0_RST = 32,
    RGU_TIMER1_RST,
    RGU_TIMER2_RST,
    RGU_TIMER3_RST,
    RGU_RITIMER_RST,
    RGU_SCT_RST,
    RGU_MOTOCONPWM_RST,
    RGU_QEI_RST,
    RGU_ADC0_RST,
    RGU_ADC1_RST,
    RGU_DAC_RST,
    RGU_UART0_RST = 44,
    RGU_UART1_RST,
    RGU_UART2_RST,
    RGU_UART3_RST,
    RGU_I2C0_RST,
    RGU_I2C1_RST,
    RGU_SSP0_RST,
    RGU_SSP1_RST,
    RGU_I2S_RST,
    RGU_SPIFI_RST,
    RGU_CAN1_RST,
    RGU_CAN0_RST,
#ifdef CHIP_LPC43XX
    RGU_M0APP_RST,
    RGU_SGPIO_RST,
    RGU_SPI_RST,
#endif
    RGU_LAST_RST = 63,
} RGU_RST_T;

typedef struct {                        /* RGU Structure          */
    __I  uint32_t  RESERVED0[64];
    __O  uint32_t  RESET_CTRL0;         /* Reset control register 0 */
    __O  uint32_t  RESET_CTRL1;         /* Reset control register 1 */
    __I  uint32_t  RESERVED1[2];
    __IO uint32_t  RESET_STATUS0;       /* Reset status register 0 */
    __IO uint32_t  RESET_STATUS1;       /* Reset status register 1 */
    __IO uint32_t  RESET_STATUS2;       /* Reset status register 2 */
    __IO uint32_t  RESET_STATUS3;       /* Reset status register 3 */
    __I  uint32_t  RESERVED2[12];
    __I  uint32_t  RESET_ACTIVE_STATUS0;/* Reset active status register 0 */
    __I  uint32_t  RESET_ACTIVE_STATUS1;/* Reset active status register 1 */
    __I  uint32_t  RESERVED3[170];
    __IO uint32_t  RESET_EXT_STAT[RGU_LAST_RST + 1];/* Reset external status registers */
} LPC_RGU_T;

/* ---------------------------------------------------------------------------
 * Windowed Watchdog register block structure
 */
#define LPC_WWDT_BASE             0x40080000

typedef struct {                /* WWDT Structure         */
    __IO uint32_t  MOD;         /* Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer. */
    __IO uint32_t  TC;          /* Watchdog timer constant register. This register determines the time-out value. */
    __O  uint32_t  FEED;        /* Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in WDTC. */
    __I  uint32_t  TV;          /* Watchdog timer value register. This register reads out the current value of the Watchdog timer. */
#ifdef WATCHDOG_CLKSEL_SUPPORT
    __IO uint32_t CLKSEL;       /* Watchdog clock select register. */
#else
    __I  uint32_t  RESERVED0;
#endif
#ifdef WATCHDOG_WINDOW_SUPPORT
    __IO uint32_t  WARNINT;     /* Watchdog warning interrupt register. This register contains the Watchdog warning interrupt compare value. */
    __IO uint32_t  WINDOW;      /* Watchdog timer window register. This register contains the Watchdog window value. */
#endif
} LPC_WWDT_T;

/* ---------------------------------------------------------------------------
 * USART register block structure
 */
#define LPC_USART0_BASE           0x40081000
#define LPC_UART1_BASE            0x40082000
#define LPC_USART2_BASE           0x400C1000
#define LPC_USART3_BASE           0x400C2000

