qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
typedef struct {                /* USARTn Structure       */

    union {
        __IO uint32_t  DLL;     /* Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB = 1). */
        __O  uint32_t  THR;     /* Transmit Holding Register. The next character to be transmitted is written here (DLAB = 0). */
        __I  uint32_t  RBR;     /* Receiver Buffer Register. Contains the next received character to be read (DLAB = 0). */
    };

    union {
        __IO uint32_t IER;      /* Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts (DLAB = 0). */
        __IO uint32_t DLM;      /* Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB = 1). */
    };

    union {
        __O  uint32_t FCR;      /* FIFO Control Register. Controls UART FIFO usage and modes. */
        __I  uint32_t IIR;      /* Interrupt ID Register. Identifies which interrupt(s) are pending. */
    };

    __IO uint32_t LCR;          /* Line Control Register. Contains controls for frame formatting and break generation. */
    __IO uint32_t MCR;          /* Modem Control Register. Only present on USART ports with full modem support. */
    __I  uint32_t LSR;          /* Line Status Register. Contains flags for transmit and receive status, including line errors. */
    __I  uint32_t MSR;          /* Modem Status Register. Only present on USART ports with full modem support. */
    __IO uint32_t SCR;          /* Scratch Pad Register. Eight-bit temporary storage for software. */
    __IO uint32_t ACR;          /* Auto-baud Control Register. Contains controls for the auto-baud feature. */
    __IO uint32_t ICR;          /* IrDA control register (not all UARTS) */
    __IO uint32_t FDR;          /* Fractional Divider Register. Generates a clock input for the baud rate divider. */
    __IO uint32_t OSR;          /* Oversampling Register. Controls the degree of oversampling during each bit time. Only on some UARTS. */
    __IO uint32_t TER1;         /* Transmit Enable Register. Turns off USART transmitter for use with software flow control. */
    uint32_t  RESERVED0[3];
    __IO uint32_t HDEN;         /* Half-duplex enable Register- only on some UARTs */
    __I  uint32_t RESERVED1[1];
    __IO uint32_t SCICTRL;      /* Smart card interface control register- only on some UARTs */
    __IO uint32_t RS485CTRL;    /* RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes. */
    __IO uint32_t RS485ADRMATCH; /* RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode. */
    __IO uint32_t RS485DLY;     /* RS-485/EIA-485 direction control delay. */
    union {
        __IO uint32_t SYNCCTRL; /* Synchronous mode control register. Only on USARTs. */
        __I  uint32_t FIFOLVL;  /* FIFO Level register. Provides the current fill levels of the transmit and receive FIFOs. */
    };

    __IO uint32_t TER2;         /* Transmit Enable Register. Only on LPC177X_8X UART4 and LPC18XX/43XX USART0/2/3. */
} LPC_USART_T;

/* ---------------------------------------------------------------------------
 * SSP register block structure
 */
#define LPC_SSP0_BASE             0x40083000
#define LPC_SSP1_BASE             0x400C5000

typedef struct {            /* SSPn Structure         */
    __IO uint32_t CR0;      /* Control Register 0. Selects the serial clock rate, bus type, and data size. */
    __IO uint32_t CR1;      /* Control Register 1. Selects master/slave and other modes. */
    __IO uint32_t DR;       /* Data Register. Writes fill the transmit FIFO, and reads empty the receive FIFO. */
    __I  uint32_t SR;       /* Status Register        */
    __IO uint32_t CPSR;     /* Clock Prescale Register */
    __IO uint32_t IMSC;     /* Interrupt Mask Set and Clear Register */
    __I  uint32_t RIS;      /* Raw Interrupt Status Register */
    __I  uint32_t MIS;      /* Masked Interrupt Status Register */
    __O  uint32_t ICR;      /* SSPICR Interrupt Clear Register */
    __IO uint32_t DMACR;    /* SSPn DMA control register */
} LPC_SSP_T;

/* ---------------------------------------------------------------------------
 * 32-bit Standard timer register block structure
 */
#define LPC_TIMER0_BASE           0x40084000
#define LPC_TIMER1_BASE           0x40085000
#define LPC_TIMER2_BASE           0x400C3000
#define LPC_TIMER3_BASE           0x400C4000

typedef struct {            /* TIMERn Structure       */
    __IO uint32_t IR;       /* Interrupt Register. The IR can be written to clear interrupts. The IR can be read to identify which of eight possible interrupt sources are pending. */
    __IO uint32_t TCR;      /* Timer Control Register. The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR. */
    __IO uint32_t TC;       /* Timer Counter. The 32 bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR. */
    __IO uint32_t PR;       /* Prescale Register. The Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC. */
    __IO uint32_t PC;       /* Prescale Counter. The 32 bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface. */
    __IO uint32_t MCR;      /* Match Control Register. The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs. */
    __IO uint32_t MR[4];    /* Match Register. MR can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR matches the TC. */
    __IO uint32_t CCR;      /* Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place. */
    __IO uint32_t CR[4];    /* Capture Register. CR is loaded with the value of TC when there is an event on the CAPn.0 input. */
    __IO uint32_t EMR;      /* External Match Register. The EMR controls the external match pins MATn.0-3 (MAT0.0-3 and MAT1.0-3 respectively). */
    __I  uint32_t RESERVED0[12];
    __IO uint32_t CTCR;     /* Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting. */
} LPC_TIMER_T;

/* ---------------------------------------------------------------------------
 * System Control Unit register block
 */
#define LPC_SCU_BASE              0x40086000

