qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
typedef struct {                /* GPIO_GROUP_INTn Structure */
    __IO uint32_t  CTRL;        /* GPIO grouped interrupt control register */
    __I  uint32_t  RESERVED0[7];
    __IO uint32_t  PORT_POL[8]; /* GPIO grouped interrupt port polarity register */
    __IO uint32_t  PORT_ENA[8]; /* GPIO grouped interrupt port m enable register */
} LPC_GPIOGROUPINT_T;

/* ---------------------------------------------------------------------------
 * Motor Control PWM register block structure
 */
#define LPC_MCPWM_BASE            0x400A0000

typedef struct {                /* MCPWM Structure        */
    __I  uint32_t  CON;         /* PWM Control read address */
    __O  uint32_t  CON_SET;     /* PWM Control set address */
    __O  uint32_t  CON_CLR;     /* PWM Control clear address */
    __I  uint32_t  CAPCON;      /* Capture Control read address */
    __O  uint32_t  CAPCON_SET;  /* Capture Control set address */
    __O  uint32_t  CAPCON_CLR;  /* Event Control clear address */
    __IO uint32_t TC[3];        /* Timer Counter register */
    __IO uint32_t LIM[3];       /* Limit register         */
    __IO uint32_t MAT[3];       /* Match register         */
    __IO uint32_t  DT;          /* Dead time register     */
    __IO uint32_t  CCP;         /* Communication Pattern register */
    __I  uint32_t CAP[3];       /* Capture register       */
    __I  uint32_t  INTEN;       /* Interrupt Enable read address */
    __O  uint32_t  INTEN_SET;   /* Interrupt Enable set address */
    __O  uint32_t  INTEN_CLR;   /* Interrupt Enable clear address */
    __I  uint32_t  CNTCON;      /* Count Control read address */
    __O  uint32_t  CNTCON_SET;  /* Count Control set address */
    __O  uint32_t  CNTCON_CLR;  /* Count Control clear address */
    __I  uint32_t  INTF;        /* Interrupt flags read address */
    __O  uint32_t  INTF_SET;    /* Interrupt flags set address */
    __O  uint32_t  INTF_CLR;    /* Interrupt flags clear address */
    __O  uint32_t  CAP_CLR;     /* Capture clear address  */
} LPC_MCPWM_T;

/* ---------------------------------------------------------------------------
 * I2C register block structure
 */
#define LPC_I2C0_BASE             0x400A1000
#define LPC_I2C1_BASE             0x400E0000

typedef struct {                /* I2C0 Structure         */
    __IO uint32_t CONSET;       /* I2C Control Set Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is set. Writing a zero has no effect on the corresponding bit in the I2C control register. */
    __I  uint32_t STAT;         /* I2C Status Register. During I2C operation, this register provides detailed status codes that allow software to determine the next action needed. */
    __IO uint32_t DAT;          /* I2C Data Register. During master or slave transmit mode, data to be transmitted is written to this register. During master or slave receive mode, data that has been received may be read from this register. */
    __IO uint32_t ADR0;         /* I2C Slave Address Register 0. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address. */
    __IO uint32_t SCLH;         /* SCH Duty Cycle Register High Half Word. Determines the high time of the I2C clock. */
    __IO uint32_t SCLL;         /* SCL Duty Cycle Register Low Half Word. Determines the low time of the I2C clock. SCLL and SCLH together determine the clock frequency generated by an I2C master and certain times used in slave mode. */
    __O  uint32_t CONCLR;       /* I2C Control Clear Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is cleared. Writing a zero has no effect on the corresponding bit in the I2C control register. */
    __IO uint32_t MMCTRL;       /* Monitor mode control register. */
    __IO uint32_t ADR1;         /* I2C Slave Address Register. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address. */
    __IO uint32_t ADR2;         /* I2C Slave Address Register. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address. */
    __IO uint32_t ADR3;         /* I2C Slave Address Register. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address. */
    __I  uint32_t DATA_BUFFER;  /* Data buffer register. The contents of the 8 MSBs of the DAT shift register will be transferred to the DATA_BUFFER automatically after every nine bits (8 bits of data plus ACK or NACK) has been received on the bus. */
    __IO uint32_t MASK[4];      /* I2C Slave address mask register */
} LPC_I2C_T;

/* ---------------------------------------------------------------------------
 * I2S register block structure
 */
#define LPC_I2S0_BASE             0x400A2000
#define LPC_I2S1_BASE             0x400A3000

typedef struct {                /* I2S Structure */
    __IO uint32_t DAO;          /* I2S Digital Audio Output Register. Contains control bits for the I2S transmit channel */
    __IO uint32_t DAI;          /* I2S Digital Audio Input Register. Contains control bits for the I2S receive channel */
    __O uint32_t TXFIFO;        /* I2S Transmit FIFO. Access register for the 8 x 32-bit transmitter FIFO */
    __I uint32_t RXFIFO;        /* I2S Receive FIFO. Access register for the 8 x 32-bit receiver FIFO */
    __I uint32_t STATE;         /* I2S Status Feedback Register. Contains status information about the I2S interface */
    __IO uint32_t DMA1;         /* I2S DMA Configuration Register 1. Contains control information for DMA request 1 */
    __IO uint32_t DMA2;         /* I2S DMA Configuration Register 2. Contains control information for DMA request 2 */
    __IO uint32_t IRQ;          /* I2S Interrupt Request Control Register. Contains bits that control how the I2S interrupt request is generated */
    __IO uint32_t TXRATE;       /* I2S Transmit MCLK divider. This register determines the I2S TX MCLK rate by specifying the value to divide PCLK by in order to produce MCLK */
    __IO uint32_t RXRATE;       /* I2S Receive MCLK divider. This register determines the I2S RX MCLK rate by specifying the value to divide PCLK by in order to produce MCLK */
    __IO uint32_t TXBITRATE;    /* I2S Transmit bit rate divider. This register determines the I2S transmit bit rate by specifying the value to divide TX_MCLK by in order to produce the transmit bit clock */
    __IO uint32_t RXBITRATE;    /* I2S Receive bit rate divider. This register determines the I2S receive bit rate by specifying the value to divide RX_MCLK by in order to produce the receive bit clock */
    __IO uint32_t TXMODE;       /* I2S Transmit mode control */
    __IO uint32_t RXMODE;       /* I2S Receive mode control */
} LPC_I2S_T;

/* ---------------------------------------------------------------------------
 * CCAN Controller Area Network register block structure
 */
#define LPC_C_CAN1_BASE           0x400A4000
#define LPC_C_CAN0_BASE           0x400E2000

typedef struct {    /* C_CAN message interface Structure       */
    __IO uint32_t IF_CMDREQ;    /* Message interface command request  */
    union {
        __IO uint32_t IF_CMDMSK_R; /* Message interface command mask (read direction) */
        __IO uint32_t IF_CMDMSK_W; /* Message interface command mask (write direction) */
    };

    __IO uint32_t IF_MSK1;      /* Message interface mask 1 */
    __IO uint32_t IF_MSK2;      /* Message interface mask 2 */
    __IO uint32_t IF_ARB1;      /* Message interface arbitration 1 */
    __IO uint32_t IF_ARB2;      /* Message interface arbitration 2 */
    __IO uint32_t IF_MCTRL;     /* Message interface message control */
    __IO uint32_t IF_DA1;       /* Message interface data A1 */
    __IO uint32_t IF_DA2;       /* Message interface data A2 */
    __IO uint32_t IF_DB1;       /* Message interface data B1 */
    __IO uint32_t IF_DB2;       /* Message interface data B2 */
    __I  uint32_t  RESERVED[13];
} LPC_CCAN_IF_T;

typedef struct {                /* C_CAN Structure       */
    __IO uint32_t CNTL;         /* CAN control            */
    __IO uint32_t STAT;         /* Status register        */
    __I  uint32_t EC;           /* Error counter          */
    __IO uint32_t BT;           /* Bit timing register    */
    __I  uint32_t INT;          /* Interrupt register     */
    __IO uint32_t TEST;         /* Test register          */
    __IO uint32_t BRPE;         /* Baud rate prescaler extension register */
    __I  uint32_t  RESERVED0;
    LPC_CCAN_IF_T IF[2];
    __I  uint32_t  RESERVED2[8];
    __I  uint32_t TXREQ1;       /* Transmission request 1 */
    __I  uint32_t TXREQ2;       /* Transmission request 2 */
    __I  uint32_t  RESERVED3[6];
    __I  uint32_t ND1;          /* New data 1             */
    __I  uint32_t ND2;          /* New data 2             */
    __I  uint32_t  RESERVED4[6];
    __I  uint32_t IR1;          /* Interrupt pending 1    */
    __I  uint32_t IR2;          /* Interrupt pending 2    */
    __I  uint32_t  RESERVED5[6];
    __I  uint32_t MSGV1;        /* Message valid 1        */
    __I  uint32_t MSGV2;        /* Message valid 2        */
    __I  uint32_t  RESERVED6[6];
    __IO uint32_t CLKDIV;       /* CAN clock divider register */
} LPC_CCAN_T;

/* ---------------------------------------------------------------------------
 * Repetitive Interrupt Timer register block structure
 */
#define LPC_RITIMER_BASE          0x400C0000

typedef struct {                /* RITIMER Structure      */
    __IO uint32_t  COMPVAL;     /* Compare register       */
    __IO uint32_t  MASK;        /* Mask register. This register holds the 32-bit mask value. A 1 written to any bit will force a compare on the corresponding bit of the counter and compare register. */
    __IO uint32_t  CTRL;        /* Control register.      */
    __IO uint32_t  COUNTER;     /* 32-bit counter         */
} LPC_RITIMER_T;

/* ---------------------------------------------------------------------------
 * Quadrature Encoder Interface register block structure
 */
#define LPC_QEI_BASE              0x400C6000

typedef struct {                /* QEI Structure          */
    __O  uint32_t  CON;         /* Control register       */
    __I  uint32_t  STAT;        /* Encoder status register */
    __IO uint32_t  CONF;        /* Configuration register */
    __I  uint32_t  POS;         /* Position register      */
    __IO uint32_t  MAXPOS;      /* Maximum position register */
    __IO uint32_t  CMPOS0;      /* position compare register 0 */
    __IO uint32_t  CMPOS1;      /* position compare register 1 */
    __IO uint32_t  CMPOS2;      /* position compare register 2 */
    __I  uint32_t  INXCNT;      /* Index count register   */
    __IO uint32_t  INXCMP0;     /* Index compare register 0 */
    __IO uint32_t  LOAD;        /* Velocity timer reload register */
    __I  uint32_t  TIME;        /* Velocity timer register */
    __I  uint32_t  VEL;         /* Velocity counter register */
    __I  uint32_t  CAP;         /* Velocity capture register */
    __IO uint32_t  VELCOMP;     /* Velocity compare register */
    __IO uint32_t  FILTERPHA;   /* Digital filter register on input phase A (QEI_A) */
    __IO uint32_t  FILTERPHB;   /* Digital filter register on input phase B (QEI_B) */
    __IO uint32_t  FILTERINX;   /* Digital filter register on input index (QEI_IDX) */
    __IO uint32_t  WINDOW;      /* Index acceptance window register */
    __IO uint32_t  INXCMP1;     /* Index compare register 1 */
    __IO uint32_t  INXCMP2;     /* Index compare register 2 */
    __I  uint32_t  RESERVED0[993];
    __O  uint32_t  IEC;         /* Interrupt enable clear register */
    __O  uint32_t  IES;         /* Interrupt enable set register */
    __I  uint32_t  INTSTAT;     /* Interrupt status register */
    __I  uint32_t  IE;          /* Interrupt enable register */
    __O  uint32_t  CLR;         /* Interrupt status clear register */
    __O  uint32_t  SET;         /* Interrupt status set register */
} LPC_QEI_T;

/* ---------------------------------------------------------------------------
 * Global Input Multiplexer Array (GIMA) register block structure
 */
#define LPC_GIMA_BASE             0x400C7000

typedef struct {                        /* GIMA Structure */
    __IO uint32_t  CAP0_IN[4][4];       /* Timer x CAP0_y capture input multiplexer (GIMA output ((x*4)+y)) */
    __IO uint32_t  CTIN_IN[8];          /* SCT CTIN_x capture input multiplexer (GIMA output (16+x)) */
    __IO uint32_t  VADC_TRIGGER_IN;     /* VADC trigger input multiplexer (GIMA output 24) */
    __IO uint32_t  EVENTROUTER_13_IN;   /* Event router input 13 multiplexer (GIMA output 25) */
    __IO uint32_t  EVENTROUTER_14_IN;   /* Event router input 14 multiplexer (GIMA output 26) */
    __IO uint32_t  EVENTROUTER_16_IN;   /* Event router input 16 multiplexer (GIMA output 27) */
    __IO uint32_t  ADCSTART0_IN;        /* ADC start0 input multiplexer (GIMA output 28) */
    __IO uint32_t  ADCSTART1_IN;        /* ADC start1 input multiplexer (GIMA output 29) */
} LPC_GIMA_T;

/* ---------------------------------------------------------------------------
 * DAC register block structure
 */
#define LPC_DAC_BASE              0x400E1000

typedef struct {            /* DAC Structure          */
    __IO uint32_t  CR;      /* DAC register. Holds the conversion data. */
    __IO uint32_t  CTRL;    /* DAC control register.  */
    __IO uint32_t  CNTVAL;  /* DAC counter value register. */
} LPC_DAC_T;

/* After the selected settling time after this field is written with a
 * new VALUE, the voltage on the AOUT pin (with respect to VSSA)
 * is VALUE/1024 ? VREF
 */
#define DAC_RANGE           0x3FF
#define DAC_SET(n)          ((uint32_t) ((n & DAC_RANGE) << 6))
#define DAC_GET(n)          ((uint32_t) ((n >> 6) & DAC_RANGE))
#define DAC_VALUE(n)        DAC_SET(n)
/* If this bit = 0: The settling time of the DAC is 1 microsecond max,
 * and the maximum current is 700 microAmpere
 * If this bit = 1: The settling time of the DAC is 2.5 microsecond
 * and the maximum current is 350 microAmpere
 */
#define DAC_BIAS_EN         ((uint32_t) (1 << 16))
/* Value to reload interrupt DMA counter */
#define DAC_CCNT_VALUE(n)   ((uint32_t) (n & 0xffff))

#define DAC_DBLBUF_ENA      ((uint32_t) (1 << 1))
#define DAC_CNT_ENA         ((uint32_t) (1 << 2))
#define DAC_DMA_ENA         ((uint32_t) (1 << 3))
#define DAC_DACCTRL_MASK    ((uint32_t) (0x0F))

/* Current option in DAC configuration option */
typedef enum DAC_CURRENT_OPT {
    DAC_MAX_UPDATE_RATE_1MHz = 0,    /* Shorter settling times and higher power consumption;
                                        allows for a maximum update rate of 1 MHz */
    DAC_MAX_UPDATE_RATE_400kHz        /* Longer settling times and lower power consumption;
                                        allows for a maximum update rate of 400 kHz */
} DAC_CURRENT_OPT_T;

/* ---------------------------------------------------------------------------
 * ADC register block structure
 */
#define LPC_ADC0_BASE             0x400E3000
#define LPC_ADC1_BASE             0x400E4000
#define ADC_ACC_10BITS

/* ---------------------------------------------------------------------------
 * 10 or 12-bit ADC register block structure
 */
typedef struct {                    /* ADCn Structure */
    __IO uint32_t CR;                /* A/D Control Register. The AD0CR register must be written to select the operating mode before A/D conversion can occur. */
    __I  uint32_t GDR;                /* A/D Global Data Register. Contains the result of the most recent A/D conversion. */
    __I  uint32_t RESERVED0;
    __IO uint32_t INTEN;            /* A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt. */
    __I  uint32_t DR[8];            /* A/D Channel Data Register. This register contains the result of the most recent conversion completed on channel n. */
    __I  uint32_t STAT;                /* A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag. */
} LPC_ADC_T;

/* ADC register support bitfields and mask */
#define ADC_RANGE               0x3FF
#define ADC_DR_RESULT(n)        ((((n) >> 6) & 0x3FF))   /* Mask for getting the 10 bits ADC data read value */
#define ADC_CR_BITACC(n)        ((((n) & 0x7) << 17))    /* Number of ADC accuracy bits */
#define ADC_DR_DONE(n)          (((n) >> 31))            /* Mask for reading the ADC done status */
#define ADC_DR_OVERRUN(n)       ((((n) >> 30) & (1UL)))  /* Mask for reading the ADC overrun status */
#define ADC_CR_CH_SEL(n)        ((1UL << (n)))           /* Selects which of the AD0.0:7 pins is (are) to be sampled and converted */
#define ADC_CR_CLKDIV(n)        ((((n) & 0xFF) << 8))    /* The APB clock (PCLK) is divided by (this value plus one) to produce the clock for the A/D */
#define ADC_CR_BURST            ((1UL << 16))            /* Repeated conversions A/D enable bit */
#define ADC_CR_PDN              ((1UL << 21))            /* ADC convert is operational */
#define ADC_CR_START_MASK       ((7UL << 24))            /* ADC start mask bits */
#define ADC_CR_START_MODE_SEL(SEL)  ((SEL << 24))        /* Select Start Mode */
#define ADC_CR_START_NOW        ((1UL << 24))            /* Start conversion now */
#define ADC_CR_START_CTOUT15    ((2UL << 24))            /* Start conversion when the edge selected by bit 27 occurs on CTOUT_15 */
#define ADC_CR_START_CTOUT8     ((3UL << 24))            /* Start conversion when the edge selected by bit 27 occurs on CTOUT_8 */
#define ADC_CR_START_ADCTRIG0   ((4UL << 24))            /* Start conversion when the edge selected by bit 27 occurs on ADCTRIG0 */
#define ADC_CR_START_ADCTRIG1   ((5UL << 24))            /* Start conversion when the edge selected by bit 27 occurs on ADCTRIG1 */
#define ADC_CR_START_MCOA2      ((6UL << 24))            /* Start conversion when the edge selected by bit 27 occurs on Motocon PWM output MCOA2 */
#define ADC_CR_EDGE             ((1UL << 27))            /* Start conversion on a falling edge on the selected CAP/MAT signal */
#define ADC_CONFIG_MASK         (ADC_CR_CLKDIV(0xFF) | ADC_CR_BITACC(0x07) | ADC_CR_PDN)

