qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
/*    ADC status register used for IP drivers */
typedef enum ADC_STATUS {
    ADC_DR_DONE_STAT,   /* ADC data register staus */
    ADC_DR_OVERRUN_STAT,/* ADC data overrun staus */
    ADC_DR_ADINT_STAT   /* ADC interrupt status */
} ADC_STATUS_T;

/** Start mode, which controls the start of an A/D conversion when the BURST bit is 0. */
typedef enum ADC_START_MODE {
    ADC_NO_START = 0,
    ADC_START_NOW,          /* Start conversion now */
    ADC_START_ON_CTOUT15,   /* Start conversion when the edge selected by bit 27 occurs on CTOUT_15 */
    ADC_START_ON_CTOUT8,    /* Start conversion when the edge selected by bit 27 occurs on CTOUT_8 */
    ADC_START_ON_ADCTRIG0,  /* Start conversion when the edge selected by bit 27 occurs on ADCTRIG0 */
    ADC_START_ON_ADCTRIG1,  /* Start conversion when the edge selected by bit 27 occurs on ADCTRIG1 */
    ADC_START_ON_MCOA2      /* Start conversion when the edge selected by bit 27 occurs on Motocon PWM output MCOA2 */
} ADC_START_MODE_T;

/* ---------------------------------------------------------------------------
 * GPIO port register block structure
 */
#define LPC_GPIO_PORT_BASE        0x400F4000
#define LPC_GPIO0_BASE            (LPC_GPIO_PORT_BASE)
#define LPC_GPIO1_BASE            (LPC_GPIO_PORT_BASE + 0x04)
#define LPC_GPIO2_BASE            (LPC_GPIO_PORT_BASE + 0x08)
#define LPC_GPIO3_BASE            (LPC_GPIO_PORT_BASE + 0x0C)
#define LPC_GPIO4_BASE            (LPC_GPIO_PORT_BASE + 0x10)
#define LPC_GPIO5_BASE            (LPC_GPIO_PORT_BASE + 0x14)
#define LPC_GPIO6_BASE            (LPC_GPIO_PORT_BASE + 0x18)
#define LPC_GPIO7_BASE            (LPC_GPIO_PORT_BASE + 0x1C)

typedef struct {                /* GPIO_PORT Structure */
    __IO uint8_t B[128][32];    /* Offset 0x0000: Byte pin registers ports 0 to n; pins PIOn_0 to PIOn_31 */
    __IO uint32_t W[32][32];    /* Offset 0x1000: Word pin registers port 0 to n */
    __IO uint32_t DIR[32];      /* Offset 0x2000: Direction registers port n */
    __IO uint32_t MASK[32];     /* Offset 0x2080: Mask register port n */
    __IO uint32_t PIN[32];      /* Offset 0x2100: Portpin register port n */
    __IO uint32_t MPIN[32];     /* Offset 0x2180: Masked port register port n */
    __IO uint32_t SET[32];      /* Offset 0x2200: Write: Set register for port n Read: output bits for port n */
    __O  uint32_t CLR[32];      /* Offset 0x2280: Clear port n */
    __O  uint32_t NOT[32];      /* Offset 0x2300: Toggle port n */
} LPC_GPIO_T;

/* Calculate GPIO offset and port register address from group and pin number */
#define GPIO_OFF(port, pin)        ((port << 5) + pin)
#define GPIO_REG(port, pin)        ((__IO uint32_t *)(LPC_GPIO_PORT_BASE + 0x2000 + GPIO_OFF(port, pin)))

/* ---------------------------------------------------------------------------
 * SPI register block structure
 */
#define LPC_SPI_BASE              0x40100000

typedef struct {                /* SPI Structure          */
    __IO uint32_t  CR;          /* SPI Control Register. This register controls the operation of the SPI. */
    __I  uint32_t  SR;          /* SPI Status Register. This register shows the status of the SPI. */
    __IO uint32_t  DR;          /* SPI Data Register. This bi-directional register provides the transmit and receive data for the SPI. */
    __IO uint32_t  CCR;         /* SPI Clock Counter Register. This register controls the frequency of a master's SCK0. */
    __I  uint32_t  RESERVED0[3];
    __IO uint32_t  INT;         /* SPI Interrupt Flag. This register contains the interrupt flag for the SPI interface. */
} LPC_SPI_T;

/* SPI CFG Register BitMask */
#define SPI_CR_BITMASK       ((uint32_t) 0xFFC)
/* Enable of controlling the number of bits per transfer  */
#define SPI_CR_BIT_EN         ((uint32_t) (1 << 2))
/* Mask of field of bit controlling */
#define SPI_CR_BITS_MASK      ((uint32_t) 0xF00)
/* Set the number of bits per a transfer */
#define SPI_CR_BITS(n)        ((uint32_t) ((n << 8) & 0xF00))    /* n is in range 8-16 */
/* SPI Clock Phase Select*/
#define SPI_CR_CPHA_FIRST     ((uint32_t) (0))    /*Capture data on the first edge, Change data on the following edge*/
#define SPI_CR_CPHA_SECOND    ((uint32_t) (1 << 3))  /* Change data on the first edge, Capture data on the following edge*/
/* SPI Clock Polarity Select*/
#define SPI_CR_CPOL_LO        ((uint32_t) (0))    /* The rest state of the clock (between frames) is low.*/
#define SPI_CR_CPOL_HI        ((uint32_t) (1 << 4))  /* The rest state of the clock (between frames) is high.*/
/* SPI Slave Mode Select */
#define SPI_CR_SLAVE_EN       ((uint32_t) 0)
/* SPI Master Mode Select */
#define SPI_CR_MASTER_EN      ((uint32_t) (1 << 5))
/* SPI MSB First mode enable */
#define SPI_CR_MSB_FIRST_EN   ((uint32_t) 0)      /* Data will be transmitted and received in standard order (MSB first).*/
/* SPI LSB First mode enable */
#define SPI_CR_LSB_FIRST_EN   ((uint32_t) (1 << 6)) /* Data will be transmitted and received in reverse order (LSB first).*/
/* SPI interrupt enable */
#define SPI_CR_INT_EN         ((uint32_t) (1 << 7))
/* SPI STAT Register BitMask */
#define SPI_SR_BITMASK        ((uint32_t) 0xF8)
/* Slave abort Flag */
#define SPI_SR_ABRT           ((uint32_t) (1 << 3)) /* When 1, this bit indicates that a slave abort has occurred. */
/* Mode fault Flag */
#define SPI_SR_MODF           ((uint32_t) (1 << 4)) /* when 1, this bit indicates that a Mode fault error has occurred. */
/* Read overrun flag*/
#define SPI_SR_ROVR           ((uint32_t) (1 << 5)) /* When 1, this bit indicates that a read overrun has occurred. */
/* Write collision flag. */
#define SPI_SR_WCOL           ((uint32_t) (1 << 6)) /* When 1, this bit indicates that a write collision has occurred.. */
/* SPI transfer complete flag. */
#define SPI_SR_SPIF           ((uint32_t) (1 << 7)) /* When 1, this bit indicates when a SPI data transfer is complete.. */
/* SPI error flag */
#define SPI_SR_ERROR          (SPI_SR_ABRT | SPI_SR_MODF | SPI_SR_ROVR | SPI_SR_WCOL)
/* Enable SPI Test Mode */
#define SPI_TCR_TEST(n)       ((uint32_t) ((n & 0x3F) << 1))
/* SPI interrupt flag */
#define SPI_INT_SPIF          ((uint32_t) (1 << 0))
/* Receiver Data  */
#define SPI_DR_DATA(n)        ((uint32_t) ((n) & 0xFFFF))

/* SPI Mode*/
typedef enum LPC_SPI_MODE {
    SPI_MODE_MASTER = SPI_CR_MASTER_EN, /* Master Mode */
    SPI_MODE_SLAVE = SPI_CR_SLAVE_EN,   /* Slave Mode */
} LPC_SPI_MODE_T;

/* SPI Clock Mode*/
typedef enum LPC_SPI_CLOCK_MODE {
    SPI_CLOCK_CPHA0_CPOL0 = SPI_CR_CPOL_LO | SPI_CR_CPHA_FIRST,     /* CPHA = 0, CPOL = 0 */
    SPI_CLOCK_CPHA0_CPOL1 = SPI_CR_CPOL_HI | SPI_CR_CPHA_FIRST,     /* CPHA = 0, CPOL = 1 */
    SPI_CLOCK_CPHA1_CPOL0 = SPI_CR_CPOL_LO | SPI_CR_CPHA_SECOND,    /* CPHA = 1, CPOL = 0 */
    SPI_CLOCK_CPHA1_CPOL1 = SPI_CR_CPOL_HI | SPI_CR_CPHA_SECOND,    /* CPHA = 1, CPOL = 1 */
    SPI_CLOCK_MODE0 = SPI_CLOCK_CPHA0_CPOL0, /* alias */
    SPI_CLOCK_MODE1 = SPI_CLOCK_CPHA1_CPOL0, /* alias */
    SPI_CLOCK_MODE2 = SPI_CLOCK_CPHA0_CPOL1, /* alias */
    SPI_CLOCK_MODE3 = SPI_CLOCK_CPHA1_CPOL1, /* alias */
} LPC_SPI_CLOCK_MODE_T;

