qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC43XX/LPC43xx.h
/* SPI Data Order Mode*/
typedef enum LPC_SPI_DATA_ORDER {
    SPI_DATA_MSB_FIRST = SPI_CR_MSB_FIRST_EN,     /* Standard Order */
    SPI_DATA_LSB_FIRST = SPI_CR_LSB_FIRST_EN,     /* Reverse Order */
} LPC_SPI_DATA_ORDER_T;

/* ---------------------------------------------------------------------------
 * Serial GPIO register block structure
 */
#define LPC_SGPIO_BASE            0x40101000

typedef struct {                        /* SGPIO Structure        */
    __IO uint32_t  OUT_MUX_CFG[16];     /* Pin multiplexer configurationregisters. */
    __IO uint32_t  SGPIO_MUX_CFG[16];   /* SGPIO multiplexer configuration registers. */
    __IO uint32_t  SLICE_MUX_CFG[16];   /* Slice multiplexer configuration registers. */
    __IO uint32_t  REG[16];             /* Slice data registers. Eachtime COUNT0 reaches 0x0 the register shifts loading bit 31 withdata captured from DIN(n). DOUT(n) is set to REG(0) */
    __IO uint32_t  REG_SS[16];          /* Slice data shadow registers. Each time POSreaches 0x0 the contents of REG_SS is exchanged with the contentof REG */
    __IO uint32_t  PRESET[16];          /* Reload valueof COUNT0, loaded when COUNT0 reaches 0x0 */
    __IO uint32_t  COUNT[16];           /* Down counter, counts down each clock cycle. */
    __IO uint32_t  POS[16];             /* Each time COUNT0 reaches 0x0 */
    __IO uint32_t  MASK_A;              /* Mask for pattern match function of slice A */
    __IO uint32_t  MASK_H;              /* Mask for pattern match function of slice H */
    __IO uint32_t  MASK_I;              /* Mask for pattern match function of slice I */
    __IO uint32_t  MASK_P;              /* Mask for pattern match function of slice P */
    __I  uint32_t  GPIO_INREG;          /* GPIO input status register */
    __IO uint32_t  GPIO_OUTREG;         /* GPIO output control register */
    __IO uint32_t  GPIO_OENREG;         /* GPIO OE control register */
    __IO uint32_t  CTRL_ENABLED;        /* Enables the slice COUNT counter */
    __IO uint32_t  CTRL_DISABLED;       /* Disables the slice COUNT counter */
    __I  uint32_t  RESERVED0[823];
    __O  uint32_t  CLR_EN_0;            /* Shift clock interrupt clear mask */
    __O  uint32_t  SET_EN_0;            /* Shift clock interrupt set mask */
    __I  uint32_t  ENABLE_0;            /* Shift clock interrupt enable */
    __I  uint32_t  STATUS_0;            /* Shift clock interrupt status */
    __O  uint32_t  CTR_STATUS_0;        /* Shift clock interrupt clear status */
    __O  uint32_t  SET_STATUS_0;        /* Shift clock interrupt set status */
    __I  uint32_t  RESERVED1[2];
    __O  uint32_t  CLR_EN_1;            /* Capture clock interrupt clear mask */
    __O  uint32_t  SET_EN_1;            /* Capture clock interrupt set mask */
    __I  uint32_t  ENABLE_1;            /* Capture clock interrupt enable */
    __I  uint32_t  STATUS_1;            /* Capture clock interrupt status */
    __O  uint32_t  CTR_STATUS_1;        /* Capture clock interrupt clear status */
    __O  uint32_t  SET_STATUS_1;        /* Capture clock interrupt set status */
    __I  uint32_t  RESERVED2[2];
    __O  uint32_t  CLR_EN_2;            /* Pattern match interrupt clear mask */
    __O  uint32_t  SET_EN_2;            /* Pattern match interrupt set mask */
    __I  uint32_t  ENABLE_2;            /* Pattern match interrupt enable */
    __I  uint32_t  STATUS_2;            /* Pattern match interrupt status */
    __O  uint32_t  CTR_STATUS_2;        /* Pattern match interrupt clear status */
    __O  uint32_t  SET_STATUS_2;        /* Pattern match interrupt set status */
    __I  uint32_t  RESERVED3[2];
    __O  uint32_t  CLR_EN_3;            /* Input interrupt clear mask */
    __O  uint32_t  SET_EN_3;            /* Input bit match interrupt set mask */
    __I  uint32_t  ENABLE_3;            /* Input bit match interrupt enable */
    __I  uint32_t  STATUS_3;            /* Input bit match interrupt status */
    __O  uint32_t  CTR_STATUS_3;        /* Input bit match interrupt clear status */
    __O  uint32_t  SET_STATUS_3;        /* Shift clock interrupt set status */
} LPC_SGPIO_T;

/* End of section using anonymous unions */
#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__IAR_SYSTEMS_ICC__)
  //#pragma pop // FIXME not usable for IAR
#else /* defined(__GNUC__) and others */
  /* Leave anonymous unions enabled */
#endif

/* ---------------------------------------------------------------------------
 * LPC43xx Peripheral register set declarations
 */
#define LPC_SCT               ((LPC_SCT_T           *) LPC_SCT_BASE)
#define LPC_GPDMA             ((LPC_GPDMA_T         *) LPC_GPDMA_BASE)
#define LPC_SPIFI             ((LPC_SPIFI_T         *) LPC_SPIFI_BASE)
#define LPC_SDMMC             ((LPC_SDMMC_T         *) LPC_SDMMC_BASE)
#define LPC_EMC               ((LPC_EMC_T           *) LPC_EMC_BASE)
#define LPC_USB0              ((LPC_USBHS_T         *) LPC_USB0_BASE)
#define LPC_USB1              ((LPC_USBHS_T         *) LPC_USB1_BASE)
#define LPC_LCD               ((LPC_LCD_T           *) LPC_LCD_BASE)
#define LPC_EEPROM            ((LPC_EEPROM_T        *) LPC_EEPROM_BASE)
#define LPC_ETHERNET          ((LPC_ENET_T          *) LPC_ETHERNET_BASE)
#define LPC_ATIMER            ((LPC_ATIMER_T        *) LPC_ATIMER_BASE)
#define LPC_REGFILE           ((LPC_REGFILE_T       *) LPC_REGFILE_BASE)
#define LPC_PMC               ((LPC_PMC_T           *) LPC_PMC_BASE)
#define LPC_CREG              ((LPC_CREG_T          *) LPC_CREG_BASE)
#define LPC_EVRT              ((LPC_EVRT_T          *) LPC_EVRT_BASE)
#define LPC_RTC               ((LPC_RTC_T           *) LPC_RTC_BASE)
#define LPC_CGU               ((LPC_CGU_T           *) LPC_CGU_BASE)
#define LPC_CCU1              ((LPC_CCU1_T          *) LPC_CCU1_BASE)
#define LPC_CCU2              ((LPC_CCU2_T          *) LPC_CCU2_BASE)
#define LPC_RGU               ((LPC_RGU_T           *) LPC_RGU_BASE)
#define LPC_WWDT              ((LPC_WWDT_T          *) LPC_WWDT_BASE)
#define LPC_USART0            ((LPC_USART_T         *) LPC_USART0_BASE)
#define LPC_USART2            ((LPC_USART_T         *) LPC_USART2_BASE)
#define LPC_USART3            ((LPC_USART_T         *) LPC_USART3_BASE)
#define LPC_UART1             ((LPC_USART_T         *) LPC_UART1_BASE)
#define LPC_SSP0              ((LPC_SSP_T           *) LPC_SSP0_BASE)
#define LPC_SSP1              ((LPC_SSP_T           *) LPC_SSP1_BASE)
#define LPC_TIMER0            ((LPC_TIMER_T         *) LPC_TIMER0_BASE)
#define LPC_TIMER1            ((LPC_TIMER_T         *) LPC_TIMER1_BASE)
#define LPC_TIMER2            ((LPC_TIMER_T         *) LPC_TIMER2_BASE)
#define LPC_TIMER3            ((LPC_TIMER_T         *) LPC_TIMER3_BASE)
#define LPC_SCU               ((LPC_SCU_T           *) LPC_SCU_BASE)
#define LPC_GPIO_PIN_INT      ((LPC_GPIOPININT_T    *) LPC_GPIO_PIN_INT_BASE)
#define LPC_GPIO_GROUP_INT0   ((IP_GPIOGROUPINT_T   *) LPC_GPIO_GROUP_INT0_BASE)
#define LPC_GPIO_GROUP_INT1   ((IP_GPIOGROUPINT_T   *) LPC_GPIO_GROUP_INT1_BASE)
#define LPC_MCPWM             ((LPC_MCPWM_T         *) LPC_MCPWM_BASE)
#define LPC_I2C0              ((LPC_I2C_T           *) LPC_I2C0_BASE)
#define LPC_I2C1              ((LPC_I2C_T           *) LPC_I2C1_BASE)
#define LPC_I2S0              ((LPC_I2S_T           *) LPC_I2S0_BASE)
#define LPC_I2S1              ((LPC_I2S_T           *) LPC_I2S1_BASE)
#define LPC_C_CAN1            ((LPC_CCAN_T          *) LPC_C_CAN1_BASE)
#define LPC_RITIMER           ((LPC_RITIMER_T       *) LPC_RITIMER_BASE)
#define LPC_QEI               ((LPC_QEI_T           *) LPC_QEI_BASE)
#define LPC_GIMA              ((LPC_GIMA_T          *) LPC_GIMA_BASE)
#define LPC_DAC               ((LPC_DAC_T           *) LPC_DAC_BASE)
#define LPC_C_CAN0            ((LPC_CCAN_T          *) LPC_C_CAN0_BASE)
#define LPC_ADC0              ((LPC_ADC_T           *) LPC_ADC0_BASE)
#define LPC_ADC1              ((LPC_ADC_T           *) LPC_ADC1_BASE)
#define LPC_GPIO_PORT         ((LPC_GPIO_T          *) LPC_GPIO_PORT_BASE)
#define LPC_GPIO0             ((LPC_GPIO_T          *) LPC_GPIO0_BASE)
#define LPC_GPIO1             ((LPC_GPIO_T          *) LPC_GPIO1_BASE)
#define LPC_GPIO2             ((LPC_GPIO_T          *) LPC_GPIO2_BASE)
#define LPC_GPIO3             ((LPC_GPIO_T          *) LPC_GPIO3_BASE)
#define LPC_GPIO4             ((LPC_GPIO_T          *) LPC_GPIO4_BASE)
#define LPC_GPIO5             ((LPC_GPIO_T          *) LPC_GPIO5_BASE)
#define LPC_GPIO6             ((LPC_GPIO_T          *) LPC_GPIO6_BASE)
#define LPC_GPIO7             ((LPC_GPIO_T          *) LPC_GPIO7_BASE)
#define LPC_SPI               ((LPC_SPI_T           *) LPC_SPI_BASE)
#define LPC_SGPIO             ((LPC_SGPIO_T         *) LPC_SGPIO_BASE)

#ifdef __cplusplus
}
#endif

#endif /* __LPC43XX_H */
